HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/filter/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir
runApplication blockMesh

# create sets
runApplication topoSet

# create baffles and fields
runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
