HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/filter/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;

// Baffles to create.
baffles
{
    cycLeft
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    cycLeft;

        patches
        {
            master
            {
                //- Master side patch

                name            cycLeft_half0;
                type            cyclic;
                neighbourPatch  cycLeft_half1;
            }
            slave
            {
                //- Slave side patch

                name            cycLeft_half1;
                type            cyclic;
                neighbourPatch  cycLeft_half0;
            }
        }
    }

    cycRight
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    cycRight;

        patches
        {
            master
            {
                //- Master side patch

                name            cycRight_half0;
                type            cyclic;
                neighbourPatch  cycRight_half1;
            }
            slave
            {
                //- Slave side patch

                name            cycRight_half1;
                type            cyclic;
                neighbourPatch  cycRight_half0;
            }
        }
    }
}


// ************************************************************************* //
