HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/filter/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


materialType    fluid;
mixture         standardMixture;
energy          sensibleEnthalpy;

liquids { H2O; }

solids {}

defaultSpecie     N2;

species ( N2 O2 H2O );

O2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    molWeight       31.9988;

    thermodynamicsCoeffs
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.69758 0.00061352 -1.25884e-07 1.77528e-11 -1.13644e-15 -1233.93 3.18917 );
        lowCpCoeffs     ( 3.21294 0.00112749 -5.75615e-07 1.31388e-09 -8.76855e-13 -1005.25 6.03474 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2O
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    molWeight       18.0153;

    thermodynamicsCoeffs
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282 );
        lowCpCoeffs     ( 3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

N2
{
    muModel         muSutherland;
    kappaModel      kappaSutherland;
    thermodynamics  janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    molWeight       28.0134;

    thermodynamicsCoeffs
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    muModelCoeffs
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

// ************************************************************************* //
